In [1]:
import pandas as pd
import oracledb

In [13]:

dsn = oracledb.makedsn("localhost", 1522, service_name="stu")
connection = oracledb.connect(user="ora_msan99", password="a85263259", dsn=dsn)

In [14]:

Province=[]
cur = connection.cursor()
for row in cur.execute("select * from Province"):
    tablle.append(row)
cur.close()

In [17]:
pd.DataFrame(tablle)

           0     1         2
0     Canada  2012  34834973
1     Canada  2013  35209597
2     Canada  2014  35555305
3     Canada  2015  35823591
4     Canada  2016  36257421
..       ...   ...       ...
135  Nunavut  2017     37829
136  Nunavut  2018     38487
137  Nunavut  2019     38893
138  Nunavut  2020     39581
139  Nunavut  2021     40232

[140 rows x 3 columns]